In [2]:
# pandas - manipulaçao de dados - datframe
import pandas as pd
# Series - uma dimensão
# DataFrame - tudo
# from pandas import Series, DataFrame 
series_obj = pd.Series([1,2-3,4,-5])
series_obj
series_obj.index

RangeIndex(start=0, stop=4, step=1)

In [3]:
# criando series com index
series_obj2 = pd.Series([-1,2-3,4,-5], index=['a','b','c','d'])
series_obj2
series_obj2.index
series_obj2['b']

-1

In [4]:

import numpy as np
np.exp(series_obj2)

a     0.367879
b     0.367879
c    54.598150
d     0.006738
dtype: float64

In [5]:
edata =  {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
print(edata,'\n-------')
bjt3 = pd.Series(edata)
print(bjt3)

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
-------
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [6]:
# vet com os estados 
estados = ['California', 'Ohio', 'Oregon', 'Texas']
# selecionando os estados de interesse, se nao tiver aparece vazio
objt4 = pd.Series(edata, index=estados)
objt4.isnull()

# nomeando
objt4.name = "população"
objt4.index.name="estado"
objt4

estado
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: população, dtype: float64

In [7]:
# DataFrame - tabela de dados
dados_bruto = {'estados':['fortaleza','fortaleza','fortaleza', "caucaia", "caucaia", "caucaia"],
        'ano':[2000,2001,2002,2000,2001,2002],
        'pop':[2.4,2.9,3.1,0.5,0.8,0.95]}
dados = pd.DataFrame(dados_bruto, columns=['ano', 'estados', 'pop']) # para organizar usa columns
dados

    ano    estados   pop
0  2000  fortaleza  2.40
1  2001  fortaleza  2.90
2  2002  fortaleza  3.10
3  2000    caucaia  0.50
4  2001    caucaia  0.80
5  2002    caucaia  0.95

In [8]:
# renomenandoo index
dados2 = pd.DataFrame(dados_bruto, columns=['ano', 'estados', 'pop', 'mortes'],
index= ['one', 'two', 'three', 'four', 'five', 'six'])
dados2
dados2.loc['five']

ano           2001
estados    caucaia
pop            0.8
mortes         NaN
Name: five, dtype: object

In [9]:
# para add uma coluna com valor repetido
dados2['mortes'] = 500
dados2
# add uma coluna booleana
dados2['hosp'] = dados2.estados == 'fortaleza'
dados2

        ano    estados   pop  mortes   hosp
one    2000  fortaleza  2.40     500   True
two    2001  fortaleza  2.90     500   True
three  2002  fortaleza  3.10     500   True
four   2000    caucaia  0.50     500  False
five   2001    caucaia  0.80     500  False
six    2002    caucaia  0.95     500  False

In [10]:
# para excluir um coluna
del dados2['mortes']
dados2.columns

Index(['ano', 'estados', 'pop', 'hosp'], dtype='object')

In [11]:
# fazendo um grupo de grupo (dict de dict)
popu = {'Nevada': {2001: 2.4, 2002: 2.9},
'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
data3 = pd.DataFrame(popu)
data3
# fazendo o transposto
data3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [12]:
dados =  pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
dados

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [14]:
# precisa definir é feito por coluna
# ignora os NA a nao ser que seja uma coluna de NA
dados.sum(axis='columns') # axis= 1
# skipna = True # por default
# level # cria por grupo

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [16]:
dados.cumsum() # acumulado da coluna
dados.describe() # o summary do r # funciona para var categoricas

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [29]:
import pandas_datareader.data as web # puxando dados

# selecionando as empresas (var)
todos_dados = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']} 

# seprando o preço
preco =  pd.DataFrame({ticker: data['Adj Close']
for ticker, data in todos_dados.items()})

#separando o volume
volume =  pd.DataFrame({ticker: data['Volume']
for ticker, data in todos_dados.items()})

In [35]:
preco_pct = preco.pct_change() # colocando em porcentagem
preco_pct.tail()

# fazendo a corr 2x2
preco_pct['MSFT'].corr(preco_pct['IBM'])
# podendo ser reescrita # desde que seja um atributo valido do python
preco_pct.MSFT.corr(preco_pct.IBM)

0.534188327281938

In [37]:
# fazendo a corr de todas as varr
preco_pct.corr()

preco_pct.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000362  0.000139  0.000237  0.000210
IBM   0.000139  0.000268  0.000151  0.000136
MSFT  0.000237  0.000151  0.000298  0.000224
GOOG  0.000210  0.000136  0.000224  0.000281

In [40]:
# retornar de um varr
preco_pct.corrwith(preco_pct.IBM)

# corr com dois dados
preco_pct.corrwith(volume)

AAPL   -0.054637
IBM    -0.098249
MSFT   -0.059256
GOOG   -0.117042
dtype: float64